In [11]:
import pandas as pd

df = pd.read_csv("./Data/titanic.csv")

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
inputs = df.drop(columns=['PassengerId','Survived','Name', 'SibSp', 'Parch','Ticket','Cabin','Embarked'])
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [23]:
target = df[['Survived']]
target.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [15]:
print(inputs.isnull().any())
print(inputs.isnull().sum())
null_rows = inputs[inputs.isnull().any(axis=1)]
print(null_rows)

Pclass    False
Sex       False
Age        True
Fare      False
dtype: bool
Pclass      0
Sex         0
Age       177
Fare        0
dtype: int64
     Pclass     Sex  Age     Fare
5         3    male  NaN   8.4583
17        2    male  NaN  13.0000
19        3  female  NaN   7.2250
26        3    male  NaN   7.2250
28        3  female  NaN   7.8792
..      ...     ...  ...      ...
859       3    male  NaN   7.2292
863       3  female  NaN  69.5500
868       3    male  NaN   9.5000
878       3    male  NaN   7.8958
888       3  female  NaN  23.4500

[177 rows x 4 columns]

In [17]:
inputs['Age'] = inputs['Age'].fillna(df['Age'].mean())
null_rows = inputs[inputs.isnull().any(axis=1)]
print(null_rows)
inputs.head()

Empty DataFrame
Columns: [Pclass, Sex, Age, Fare]
Index: []

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [19]:
from sklearn.preprocessing import LabelEncoder

Sex_Le = LabelEncoder()
inputs['Sex_n'] = Sex_Le.fit_transform(inputs['Sex'])
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [25]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics

X_train, X_test, Y_train, Y_test = train_test_split(inputs, target, test_size=0.2, random_state=42) 
model = DecisionTreeClassifier()
model.fit(X_train, Y_train) 
Y_train_pred = model.predict(X_train)

print(metrics.accuracy_score(Y_train, Y_train_pred))

Y_test_pred = model.predict(X_test)

print(metrics.accuracy_score(Y_test, Y_test_pred))
print(model.score(X_test, Y_test))

0.9789325842696629
0.7374301675977654
0.7374301675977654

In [27]:
model.predict([[3,22.0,7.2500,1]])

C:\Users\srika\anaconda3\Lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [29]:
model.predict([[1,38.0,71.2833,0]])

C:\Users\srika\anaconda3\Lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [31]:
model.predict_proba([[1,38.0,71.2833,0]])

AttributeError: 'DecisionTreeClassifier' object has no attribute 'coef_'